performance_testing/test_results/gradual_stress_series/stress_failure_report_10users_20260519_160613/statistics.json
{
  "03_GET_Dashboard-1" : {
    "transaction" : "03_GET_Dashboard-1",
    "sampleCount" : 4439,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.90245550799733,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 30693.0,
    "pct1ResTime" : 33.0,
    "pct2ResTime" : 57.0,
    "pct3ResTime" : 99.60000000000036,
    "throughput" : 78.01405975395431,
    "receivedKBytesPerSec" : 222.00897270430582,
    "sentKBytesPerSec" : 13.561037730667838
  },
  "03_GET_Dashboard" : {
    "transaction" : "03_GET_Dashboard",
    "sampleCount" : 5439,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 43.68983268983272,
    "medianResTime" : 10.0,
    "minResTime" : 4.0,
    "maxResTime" : 30697.0,
    "pct1ResTime" : 64.0,
    "pct2ResTime" : 89.0,
    "pct3ResTime" : 157.60000000000036,
    "throughput" : 90.37135498878459,
    "receivedKBytesPerSec" : 243.96924586691034,
    "sentKBytesPerSec" : 28.618189618468055
  },
  "03_GET_Dashboard-0" : {
    "transaction" : "03_GET_Dashboard-0",
    "sampleCount" : 4439,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.37035368326202,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 30682.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 120.60000000000036,
    "throughput" : 77.97842813477146,
    "receivedKBytesPerSec" : 29.36250982635351,
    "sentKBytesPerSec" : 13.630994761839933
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 25201,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 30.28975040672997,
    "medianResTime" : 7.0,
    "minResTime" : 2.0,
    "maxResTime" : 37220.0,
    "pct1ResTime" : 45.0,
    "pct2ResTime" : 71.0,
    "pct3ResTime" : 132.0,
    "throughput" : 418.32940473423855,
    "receivedKBytesPerSec" : 919.3732738890642,
    "sentKBytesPerSec" : 89.0364591979018
  },
  "02_POST_Login" : {
    "transaction" : "02_POST_Login",
    "sampleCount" : 5441,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 36.05201249770271,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 37220.0,
    "pct1ResTime" : 38.80000000000018,
    "pct2ResTime" : 65.0,
    "pct3ResTime" : 122.15999999999985,
    "throughput" : 91.0780046869769,
    "receivedKBytesPerSec" : 218.31221425657014,
    "sentKBytesPerSec" : 23.30316135545698
  },
  "01_GET_Login" : {
    "transaction" : "01_GET_Login",
    "sampleCount" : 5443,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.176005879110797,
    "medianResTime" : 6.0,
    "minResTime" : 3.0,
    "maxResTime" : 24046.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 65.0,
    "pct3ResTime" : 130.5600000000004,
    "throughput" : 90.39576171258697,
    "receivedKBytesPerSec" : 221.8096298504891,
    "sentKBytesPerSec" : 11.652578658263165
  }
}