performance_testing/test_results/gradual_stress_series/stress_failure_report_40users_20260519_160837/statistics.json
{
  "03_GET_Dashboard-1" : {
    "transaction" : "03_GET_Dashboard-1",
    "sampleCount" : 3424,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 75.98890186915878,
    "medianResTime" : 25.0,
    "minResTime" : 3.0,
    "maxResTime" : 27087.0,
    "pct1ResTime" : 160.5,
    "pct2ResTime" : 202.0,
    "pct3ResTime" : 456.0,
    "throughput" : 48.628765391771175,
    "receivedKBytesPerSec" : 135.0242904162702,
    "sentKBytesPerSec" : 8.453047109116474
  },
  "03_GET_Dashboard" : {
    "transaction" : "03_GET_Dashboard",
    "sampleCount" : 7548,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 103.88606253312105,
    "medianResTime" : 27.0,
    "minResTime" : 3.0,
    "maxResTime" : 27091.0,
    "pct1ResTime" : 251.0,
    "pct2ResTime" : 325.0,
    "pct3ResTime" : 639.1200000000026,
    "throughput" : 107.19154737559646,
    "receivedKBytesPerSec" : 175.5523230915204,
    "sentKBytesPerSec" : 27.190031828703706
  },
  "03_GET_Dashboard-0" : {
    "transaction" : "03_GET_Dashboard-0",
    "sampleCount" : 3424,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 75.18253504672876,
    "medianResTime" : 27.0,
    "minResTime" : 2.0,
    "maxResTime" : 14283.0,
    "pct1ResTime" : 154.0,
    "pct2ResTime" : 209.75,
    "pct3ResTime" : 457.5,
    "throughput" : 48.628765391771175,
    "receivedKBytesPerSec" : 18.313442124632516,
    "sentKBytesPerSec" : 8.500536137819374
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 29532,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 92.78795882432681,
    "medianResTime" : 31.0,
    "minResTime" : 2.0,
    "maxResTime" : 33934.0,
    "pct1ResTime" : 217.0,
    "pct2ResTime" : 290.0,
    "pct3ResTime" : 504.9700000000048,
    "throughput" : 419.10168168594333,
    "receivedKBytesPerSec" : 656.8537322385226,
    "sentKBytesPerSec" : 85.42145258284255
  },
  "02_POST_Login" : {
    "transaction" : "02_POST_Login",
    "sampleCount" : 7560,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 96.31891534391525,
    "medianResTime" : 20.0,
    "minResTime" : 3.0,
    "maxResTime" : 32186.0,
    "pct1ResTime" : 200.0,
    "pct2ResTime" : 282.0,
    "pct3ResTime" : 534.170000000001,
    "throughput" : 109.64148973198746,
    "receivedKBytesPerSec" : 164.44191079029616,
    "sentKBytesPerSec" : 28.05280303689523
  },
  "01_GET_Login" : {
    "transaction" : "01_GET_Login",
    "sampleCount" : 7576,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 93.75659978880678,
    "medianResTime" : 23.0,
    "minResTime" : 3.0,
    "maxResTime" : 33934.0,
    "pct1ResTime" : 211.0,
    "pct2ResTime" : 282.0,
    "pct3ResTime" : 535.2299999999996,
    "throughput" : 107.54641985122934,
    "receivedKBytesPerSec" : 167.3420609367015,
    "sentKBytesPerSec" : 13.863405683947532
  }
}