performance_testing/test_results/load_benchmarking_series/load_report_36mo_20260519_152021/statistics.json
{
  "01_Login_Flow" : {
    "transaction" : "01_Login_Flow",
    "sampleCount" : 486,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 29.450617283950624,
    "medianResTime" : 18.0,
    "minResTime" : 0.0,
    "maxResTime" : 1248.0,
    "pct1ResTime" : 45.0,
    "pct2ResTime" : 50.0,
    "pct3ResTime" : 223.2499999999958,
    "throughput" : 4.056422669226275,
    "receivedKBytesPerSec" : 22.804816936712292,
    "sentKBytesPerSec" : 1.5211911046657207
  },
  "03_Access_Modules" : {
    "transaction" : "03_Access_Modules",
    "sampleCount" : 472,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.819915254237284,
    "medianResTime" : 19.0,
    "minResTime" : 0.0,
    "maxResTime" : 74.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 39.0,
    "pct3ResTime" : 45.26999999999998,
    "throughput" : 4.039885308340822,
    "receivedKBytesPerSec" : 12.873406540206274,
    "sentKBytesPerSec" : 1.4508224071339924
  },
  "GET_Staff_Dashboard-0" : {
    "transaction" : "GET_Staff_Dashboard-0",
    "sampleCount" : 235,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.765957446808514,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 24.400000000000006,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 28.639999999999986,
    "throughput" : 2.011228646742665,
    "receivedKBytesPerSec" : 0.7581389234791689,
    "sentKBytesPerSec" : 0.36335673793690737
  },
  "GET_Staff_Hazards" : {
    "transaction" : "GET_Staff_Hazards",
    "sampleCount" : 231,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.3116883116883,
    "medianResTime" : 18.0,
    "minResTime" : 5.0,
    "maxResTime" : 57.0,
    "pct1ResTime" : 33.80000000000001,
    "pct2ResTime" : 39.0,
    "pct3ResTime" : 45.0,
    "throughput" : 2.0274540092683613,
    "receivedKBytesPerSec" : 6.543849864178135,
    "sentKBytesPerSec" : 0.7424758334723002
  },
  "GET_Admin_Dashboard" : {
    "transaction" : "GET_Admin_Dashboard",
    "sampleCount" : 237,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.742616033755272,
    "medianResTime" : 17.0,
    "minResTime" : 6.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 33.0,
    "pct2ResTime" : 42.099999999999994,
    "pct3ResTime" : 44.620000000000005,
    "throughput" : 2.0444958204294306,
    "receivedKBytesPerSec" : 6.598656426035834,
    "sentKBytesPerSec" : 0.7127783280208072
  },
  "GET_Admin_Dashboard-1" : {
    "transaction" : "GET_Admin_Dashboard-1",
    "sampleCount" : 237,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.000000000000004,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 19.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 28.0,
    "throughput" : 2.0446016477591336,
    "receivedKBytesPerSec" : 5.82829585526032,
    "sentKBytesPerSec" : 0.3554092708018807
  },
  "GET_Admin_Dashboard-0" : {
    "transaction" : "GET_Admin_Dashboard-0",
    "sampleCount" : 237,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.645569620253168,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 29.0,
    "throughput" : 2.044566370765289,
    "receivedKBytesPerSec" : 0.770688833389408,
    "sentKBytesPerSec" : 0.35739978551463547
  },
  "GET_Admin_Reports-0" : {
    "transaction" : "GET_Admin_Reports-0",
    "sampleCount" : 235,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.957446808510632,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 70.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 26.19999999999999,
    "pct3ResTime" : 29.0,
    "throughput" : 2.025966860354846,
    "receivedKBytesPerSec" : 0.7638124062451506,
    "sentKBytesPerSec" : 0.3798687863165336
  },
  "02_View_Dashboard" : {
    "transaction" : "02_View_Dashboard",
    "sampleCount" : 472,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.32203389830506,
    "medianResTime" : 17.0,
    "minResTime" : 6.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 41.349999999999966,
    "pct3ResTime" : 44.0,
    "throughput" : 4.033739840872382,
    "receivedKBytesPerSec" : 13.019019521335236,
    "sentKBytesPerSec" : 1.418061588242332
  },
  "GET_Staff_Dashboard" : {
    "transaction" : "GET_Staff_Dashboard",
    "sampleCount" : 235,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.906382978723403,
    "medianResTime" : 17.0,
    "minResTime" : 6.0,
    "maxResTime" : 45.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 37.19999999999999,
    "pct3ResTime" : 44.0,
    "throughput" : 2.011159797343557,
    "receivedKBytesPerSec" : 6.491096806855915,
    "sentKBytesPerSec" : 0.7129404359723743
  },
  "GET_Admin_Reports-1" : {
    "transaction" : "GET_Admin_Reports-1",
    "sampleCount" : 235,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.714893617021271,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 29.0,
    "throughput" : 2.0262288862638926,
    "receivedKBytesPerSec" : 5.775931149173557,
    "sentKBytesPerSec" : 0.3522155681200907
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3783,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.032778218345245,
    "medianResTime" : 6.0,
    "minResTime" : 0.0,
    "maxResTime" : 1248.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 43.0,
    "throughput" : 31.87616912991456,
    "receivedKBytesPerSec" : 74.1645394997388,
    "sentKBytesPerSec" : 7.19404936572069
  },
  "POST_Login" : {
    "transaction" : "POST_Login",
    "sampleCount" : 472,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.828389830508474,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 76.0,
    "pct1ResTime" : 25.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 29.0,
    "throughput" : 4.033636425787927,
    "receivedKBytesPerSec" : 11.498227272338825,
    "sentKBytesPerSec" : 1.0320436948793328
  },
  "GET_Admin_Reports" : {
    "transaction" : "GET_Admin_Reports",
    "sampleCount" : 235,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.799999999999997,
    "medianResTime" : 20.0,
    "minResTime" : 5.0,
    "maxResTime" : 74.0,
    "pct1ResTime" : 34.0,
    "pct2ResTime" : 40.0,
    "pct3ResTime" : 48.559999999999945,
    "throughput" : 2.0258969982241073,
    "receivedKBytesPerSec" : 6.538771142605906,
    "sentKBytesPerSec" : 0.732013563811445
  },
  "GET_Staff_Dashboard-1" : {
    "transaction" : "GET_Staff_Dashboard-1",
    "sampleCount" : 235,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.042553191489363,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 41.0,
    "pct1ResTime" : 23.0,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 28.0,
    "throughput" : 2.011297500855871,
    "receivedKBytesPerSec" : 5.733376372068641,
    "sentKBytesPerSec" : 0.349620073390962
  },
  "GET_Staff_Hazards-0" : {
    "transaction" : "GET_Staff_Hazards-0",
    "sampleCount" : 231,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.88744588744589,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 41.0,
    "pct1ResTime" : 24.80000000000001,
    "pct2ResTime" : 27.399999999999977,
    "pct3ResTime" : 29.0,
    "throughput" : 2.0277209645280503,
    "receivedKBytesPerSec" : 0.7645186274918584,
    "sentKBytesPerSec" : 0.390098662121119
  },
  "GET_Staff_Hazards-1" : {
    "transaction" : "GET_Staff_Hazards-1",
    "sampleCount" : 231,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.259740259740267,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 19.80000000000001,
    "pct2ResTime" : 26.0,
    "pct3ResTime" : 28.0,
    "throughput" : 2.027560782936891,
    "receivedKBytesPerSec" : 5.779736255266391,
    "sentKBytesPerSec" : 0.35244708922145174
  },
  "GET_Login_Page" : {
    "transaction" : "GET_Login_Page",
    "sampleCount" : 477,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.773584905660364,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 28.0,
    "pct3ResTime" : 30.21999999999997,
    "throughput" : 4.019617757103853,
    "receivedKBytesPerSec" : 11.6861205606187,
    "sentKBytesPerSec" : 0.5181538515016685
  }
}